src/Documents/ЕжедневныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЕжедневныйОтчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВремяРаботыСотрудниковФакт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтработанноеВремя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЕжедневныйОтчет/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРаботыСотрудника(ДокументСсылка, СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковФакт.СтруктурнаяЕдиница,
	|	ВремяРаботыСотрудниковФакт.Сотрудник,
	|	ВремяРаботыСотрудниковФакт.ДатаВремяНачала,
	|	ВремяРаботыСотрудниковФакт.ДатаВремяОкончания,
	|	ВремяРаботыСотрудниковФакт.Минуты
	|ИЗ
	|	ВременнаяТаблицаВремяРаботыСотрудниковФакт КАК ВремяРаботыСотрудниковФакт";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВремяРаботыСотрудниковФакт", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковФакт.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДОБАВИТЬКДАТЕ(ВремяРаботыСотрудниковФакт.Ссылка.ДатаОтчета, МИНУТА, РАЗНОСТЬДАТ(&ПустаяДата, ВремяРаботыСотрудниковФакт.Начало, МИНУТА)) КАК ДатаВремяНачала,
	|	ВЫБОР
	|		КОГДА ВремяРаботыСотрудниковФакт.Окончание <> &ПустаяДата
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВремяРаботыСотрудниковФакт.Ссылка.ДатаОтчета, МИНУТА, РАЗНОСТЬДАТ(&ПустаяДата, ВремяРаботыСотрудниковФакт.Окончание, МИНУТА))
	|		ИНАЧЕ &ПустаяДата
	|	КОНЕЦ КАК ДатаВремяОкончания,
	|   РАЗНОСТЬДАТ(ВремяРаботыСотрудниковФакт.Начало, ВремяРаботыСотрудниковФакт.Окончание, МИНУТА) КАК Минуты,
	|	ВремяРаботыСотрудниковФакт.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВременнаяТаблицаВремяРаботыСотрудниковФакт
	|ИЗ
	|	Документ.ЕжедневныйОтчет.ОтработанноеВремя КАК ВремяРаботыСотрудниковФакт
	|ГДЕ
	|	ВремяРаботыСотрудниковФакт.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылка);
	Запрос.УстановитьПараметр("ПустаяДата"        , Дата(01, 01, 01));
	
	
	Запрос.ВыполнитьПакет();
	СформироватьТаблицаРаботыСотрудника(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти
